modules/gateway/server/src/main/resources/com/l7tech/server/wsdm/subscription/resources/NotifyMetrics.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:wsa="http://www.w3.org/2005/08/addressing"
               xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
               xmlns:wsrf-rp="http://docs.oasis-open.org/wsrf/rp-2"
               xmlns:muws1="http://docs.oasis-open.org/wsdm/muws1-2.xsd"
               xmlns:muws2="http://docs.oasis-open.org/wsdm/muws2-2.xsd"
               xmlns:mows="http://docs.oasis-open.org/wsdm/mows-2.xsd"
               xmlns:qosm="http://metadata.dod.mil/mdr/ns/netops/esm/qosm"
               xmlns:mowse="http://docs.oasis-open.org/wsdm/mowse-2.xml">
  <soap:Header>
    <wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationConsumer/Notify</wsa:Action>
    <wsa:To>^$^$^_WSA_TARGET_^$^$^</wsa:To>
    <wsa:RelatesTo>^$^$^_RELATES_TO_^$^$^</wsa:RelatesTo>
  </soap:Header>
  <soap:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:SubscriptionReference>
          <wsa:Address>^$^$^_ESM_SUBS_SVC_URL_^$^$^</wsa:Address>
          <wsa:ReferenceParameters>
            <SubscriptionId xmlns="http://www.layer7tech.com/ns/wsdm/subscription">^$^$^_SUBSCRIPTION_ID_^$^$^</SubscriptionId>
          </wsa:ReferenceParameters>
        </wsnt:SubscriptionReference>
        <wsnt:Topic Dialect= "http://docs.oasis-open.org/wsn/t-1/TopicExpression/Simple">mowse:MetricsCapability</wsnt:Topic>
        <wsnt:Message>
          <muws1:ManagementEvent ReportTime="^$^$^_NOW_TIMESTAMP_^$^$^">
            <muws1:EventId>^$^$^_EVENT_UUID_^$^$^</muws1:EventId>
            <muws1:SourceComponent>
              <muws1:ResourceId>^$^$^_SRC_SVC_URL_^$^$^</muws1:ResourceId>
            </muws1:SourceComponent>
            <muws1:ReporterComponent>
              <muws1:ResourceId>^$^$^_ESM_SUBS_SVC_URL_^$^$^</muws1:ResourceId>
            </muws1:ReporterComponent>
            <muws2:Situation>
              <muws2:SituationCategory>
                <muws2:ReportSituation/>
              </muws2:SituationCategory>
              <muws2:SituationTime>^$^$^_NOW_TIMESTAMP_^$^$^</muws2:SituationTime>
            </muws2:Situation>
^$^$^_WRAPPED_METRICS_^$^$^
          </muws1:ManagementEvent>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </soap:Body>
</soap:Envelope>